<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"s3","backend":"dafca14615548087bef3a606ef8dd925adf7c208bab2623fc974a3b3e8749024","plan_job_ref":"Job Frontpage #79 at https://github.com/coverage-robot/frontpage/actions/runs/6613044086","plan_hash":"68344ab1134da94717e4ee087ac96f90c094231e56b94a0b915c529e0cf860f3","plan_text_format":"text","version":"1.36.2"} -->
Terraform plan in __./infrastructure__ in the __prod__ workspace
<details>
<summary>Plan: 16 to add, 1 to change, 16 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_s3_object.static_files["assets/index-7ad93794.css"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + bucket                 = "coverage-frontpage-prod"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/css; charset=utf-8"
      + etag                   = "4eaaca429703f2ea966ebf6688f1e1ff"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/index-7ad93794.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/assets/index-7ad93794.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/index-7e3e1a9e.css"] will be destroyed
  # (because key ["assets/index-7e3e1a9e.css"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - bucket                 = "coverage-frontpage-prod" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/css; charset=utf-8" -> null
      - etag                   = "f0ae4401ef933b58a86d929ab93efae7" -> null
      - force_destroy          = false -> null
      - id                     = "assets/index-7e3e1a9e.css" -> null
      - key                    = "assets/index-7e3e1a9e.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../dist/assets/index-7e3e1a9e.css" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.static_files["assets/index-7f61972d.js"] will be destroyed
  # (because key ["assets/index-7f61972d.js"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - bucket                 = "coverage-frontpage-prod" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "d129b0481515951c632cba0efb8ca5b8" -> null
      - force_destroy          = false -> null
      - id                     = "assets/index-7f61972d.js" -> null
      - key                    = "assets/index-7f61972d.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../dist/assets/index-7f61972d.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.static_files["assets/index-8f0b6843.js"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + bucket                 = "coverage-frontpage-prod"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "d129b0481515951c632cba0efb8ca5b8"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/index-8f0b6843.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/assets/index-8f0b6843.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/open-sans-cyrillic-400-normal-051a6129.woff"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + bucket                 = "coverage-frontpage-prod"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "font/woff"
      + etag                   = "018624761d66d80815e549f93177f6ea"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/open-sans-cyrillic-400-normal-051a6129.woff"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/assets/open-sans-cyrillic-400-normal-051a6129.woff"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/open-sans-cyrillic-400-normal-18c72b42.woff2"] will be destroyed
  # (because key ["assets/open-sans-cyrillic-400-normal-18c72b42.woff2"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - bucket                 = "coverage-frontpage-prod" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "font/woff2" -> null
      - etag                   = "ebcaceb931bbdcc67a4c25ffdb5e89ee" -> null
      - force_destroy          = false -> null
      - id                     = "assets/open-sans-cyrillic-400-normal-18c72b42.woff2" -> null
      - key                    = "assets/open-sans-cyrillic-400-normal-18c72b42.woff2" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../dist/assets/open-sans-cyrillic-400-normal-18c72b42.woff2" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.static_files["assets/open-sans-cyrillic-400-normal-5a3a3dc6.woff"] will be destroyed
  # (because key ["assets/open-sans-cyrillic-400-normal-5a3a3dc6.woff"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - bucket                 = "coverage-frontpage-prod" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "font/woff" -> null
      - etag                   = "70039c76a2361b431052d6ff9ca9b673" -> null
      - force_destroy          = false -> null
      - id                     = "assets/open-sans-cyrillic-400-normal-5a3a3dc6.woff" -> null
      - key                    = "assets/open-sans-cyrillic-400-normal-5a3a3dc6.woff" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../dist/assets/open-sans-cyrillic-400-normal-5a3a3dc6.woff" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.static_files["assets/open-sans-cyrillic-400-normal-624b7132.woff2"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + bucket                 = "coverage-frontpage-prod"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "font/woff2"
      + etag                   = "c010b23b2704126796a794818ca777fb"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/open-sans-cyrillic-400-normal-624b7132.woff2"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/assets/open-sans-cyrillic-400-normal-624b7132.woff2"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/open-sans-cyrillic-ext-400-normal-1d9563ed.woff2"] will be destroyed
  # (because key ["assets/open-sans-cyrillic-ext-400-normal-1d9563ed.woff2"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - bucket                 = "coverage-frontpage-prod" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "font/woff2" -> null
      - etag                   = "a079e6c3e2fcbe740140b80774d53fde" -> null
      - force_destroy          = false -> null
      - id                     = "assets/open-sans-cyrillic-ext-400-normal-1d9563ed.woff2" -> null
      - key                    = "assets/open-sans-cyrillic-ext-400-normal-1d9563ed.woff2" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../dist/assets/open-sans-cyrillic-ext-400-normal-1d9563ed.woff2" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.static_files["assets/open-sans-cyrillic-ext-400-normal-bb75dc3e.woff"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + bucket                 = "coverage-frontpage-prod"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "font/woff"
      + etag                   = "162eedfd850d085ad5b3133c69b2dccb"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/open-sans-cyrillic-ext-400-normal-bb75dc3e.woff"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/assets/open-sans-cyrillic-ext-400-normal-bb75dc3e.woff"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/open-sans-cyrillic-ext-400-normal-bbbef4da.woff2"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + bucket                 = "coverage-frontpage-prod"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "font/woff2"
      + etag                   = "fc698935623adf965e116bb6024303ce"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/open-sans-cyrillic-ext-400-normal-bbbef4da.woff2"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/assets/open-sans-cyrillic-ext-400-normal-bbbef4da.woff2"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/open-sans-cyrillic-ext-400-normal-c0f24700.woff"] will be destroyed
  # (because key ["assets/open-sans-cyrillic-ext-400-normal-c0f24700.woff"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - bucket                 = "coverage-frontpage-prod" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "font/woff" -> null
      - etag                   = "eb7f2b30523aab3b6db7ec1d29e51f73" -> null
      - force_destroy          = false -> null
      - id                     = "assets/open-sans-cyrillic-ext-400-normal-c0f24700.woff" -> null
      - key                    = "assets/open-sans-cyrillic-ext-400-normal-c0f24700.woff" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../dist/assets/open-sans-cyrillic-ext-400-normal-c0f24700.woff" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.static_files["assets/open-sans-greek-400-normal-258c8261.woff2"] will be destroyed
  # (because key ["assets/open-sans-greek-400-normal-258c8261.woff2"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - bucket                 = "coverage-frontpage-prod" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "font/woff2" -> null
      - etag                   = "a668d91b3f05f54b834bddbd715f9bc3" -> null
      - force_destroy          = false -> null
      - id                     = "assets/open-sans-greek-400-normal-258c8261.woff2" -> null
      - key                    = "assets/open-sans-greek-400-normal-258c8261.woff2" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../dist/assets/open-sans-greek-400-normal-258c8261.woff2" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.static_files["assets/open-sans-greek-400-normal-2745841d.woff"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + bucket                 = "coverage-frontpage-prod"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "font/woff"
      + etag                   = "69f605be40273dccac8a7f9de9b7c73d"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/open-sans-greek-400-normal-2745841d.woff"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/assets/open-sans-greek-400-normal-2745841d.woff"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/open-sans-greek-400-normal-7bd5dafc.woff2"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + bucket                 = "coverage-frontpage-prod"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "font/woff2"
      + etag                   = "b8ff821b54d8701399dad0bab071ae96"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/open-sans-greek-400-normal-7bd5dafc.woff2"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/assets/open-sans-greek-400-normal-7bd5dafc.woff2"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/open-sans-greek-400-normal-e2eb12bb.woff"] will be destroyed
  # (because key ["assets/open-sans-greek-400-normal-e2eb12bb.woff"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - bucket                 = "coverage-frontpage-prod" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "font/woff" -> null
      - etag                   = "07748ab5bb2d3fb6d0475044dd8cfcfe" -> null
      - force_destroy          = false -> null
      - id                     = "assets/open-sans-greek-400-normal-e2eb12bb.woff" -> null
      - key                    = "assets/open-sans-greek-400-normal-e2eb12bb.woff" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../dist/assets/open-sans-greek-400-normal-e2eb12bb.woff" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.static_files["assets/open-sans-hebrew-400-normal-100ac33d.woff2"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + bucket                 = "coverage-frontpage-prod"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "font/woff2"
      + etag                   = "44d52bf20e4bdbe79fcd85c5bb9c4aa9"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/open-sans-hebrew-400-normal-100ac33d.woff2"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/assets/open-sans-hebrew-400-normal-100ac33d.woff2"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/open-sans-hebrew-400-normal-5b70d23b.woff"] will be destroyed
  # (because key ["assets/open-sans-hebrew-400-normal-5b70d23b.woff"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - bucket                 = "coverage-frontpage-prod" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "font/woff" -> null
      - etag                   = "c57304829bfd6c5e1d31636edca81bf1" -> null
      - force_destroy          = false -> null
      - id                     = "assets/open-sans-hebrew-400-normal-5b70d23b.woff" -> null
      - key                    = "assets/open-sans-hebrew-400-normal-5b70d23b.woff" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../dist/assets/open-sans-hebrew-400-normal-5b70d23b.woff" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.static_files["assets/open-sans-hebrew-400-normal-8f8c0fd4.woff2"] will be destroyed
  # (because key ["assets/open-sans-hebrew-400-normal-8f8c0fd4.woff2"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - bucket                 = "coverage-frontpage-prod" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "font/woff2" -> null
      - etag                   = "f24f67a3984f966082f642f783bb3da6" -> null
      - force_destroy          = false -> null
      - id                     = "assets/open-sans-hebrew-400-normal-8f8c0fd4.woff2" -> null
      - key                    = "assets/open-sans-hebrew-400-normal-8f8c0fd4.woff2" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../dist/assets/open-sans-hebrew-400-normal-8f8c0fd4.woff2" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.static_files["assets/open-sans-hebrew-400-normal-fee21563.woff"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + bucket                 = "coverage-frontpage-prod"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "font/woff"
      + etag                   = "4b8a06b27d6e02a4a7ed6c454f2229f6"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/open-sans-hebrew-400-normal-fee21563.woff"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/assets/open-sans-hebrew-400-normal-fee21563.woff"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/open-sans-latin-400-normal-441e2360.woff2"] will be destroyed
  # (because key ["assets/open-sans-latin-400-normal-441e2360.woff2"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - bucket                 = "coverage-frontpage-prod" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "font/woff2" -> null
      - etag                   = "8d1c44b2bf75a4e6f1bd141f9a965f4f" -> null
      - force_destroy          = false -> null
      - id                     = "assets/open-sans-latin-400-normal-441e2360.woff2" -> null
      - key                    = "assets/open-sans-latin-400-normal-441e2360.woff2" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../dist/assets/open-sans-latin-400-normal-441e2360.woff2" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.static_files["assets/open-sans-latin-400-normal-8030191f.woff"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + bucket                 = "coverage-frontpage-prod"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "font/woff"
      + etag                   = "e4ad92e1aadc65135d0165f0ed4a7411"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/open-sans-latin-400-normal-8030191f.woff"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/assets/open-sans-latin-400-normal-8030191f.woff"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/open-sans-latin-400-normal-b34551ae.woff2"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + bucket                 = "coverage-frontpage-prod"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "font/woff2"
      + etag                   = "e43b535855a4ae53bd5b07a6eeb3bf67"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/open-sans-latin-400-normal-b34551ae.woff2"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/assets/open-sans-latin-400-normal-b34551ae.woff2"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/open-sans-latin-400-normal-e52fc979.woff"] will be destroyed
  # (because key ["assets/open-sans-latin-400-normal-e52fc979.woff"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - bucket                 = "coverage-frontpage-prod" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "font/woff" -> null
      - etag                   = "aace4135c1479ff37abe22430af78d6f" -> null
      - force_destroy          = false -> null
      - id                     = "assets/open-sans-latin-400-normal-e52fc979.woff" -> null
      - key                    = "assets/open-sans-latin-400-normal-e52fc979.woff" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../dist/assets/open-sans-latin-400-normal-e52fc979.woff" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.static_files["assets/open-sans-latin-ext-400-normal-140ef34d.woff2"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + bucket                 = "coverage-frontpage-prod"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "font/woff2"
      + etag                   = "f155ae6c5a655f05edb86445bd7e8d76"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/open-sans-latin-ext-400-normal-140ef34d.woff2"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/assets/open-sans-latin-ext-400-normal-140ef34d.woff2"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/open-sans-latin-ext-400-normal-439db95f.woff2"] will be destroyed
  # (because key ["assets/open-sans-latin-ext-400-normal-439db95f.woff2"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - bucket                 = "coverage-frontpage-prod" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "font/woff2" -> null
      - etag                   = "64b26d8be6f82e8159532c397f27165a" -> null
      - force_destroy          = false -> null
      - id                     = "assets/open-sans-latin-ext-400-normal-439db95f.woff2" -> null
      - key                    = "assets/open-sans-latin-ext-400-normal-439db95f.woff2" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../dist/assets/open-sans-latin-ext-400-normal-439db95f.woff2" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.static_files["assets/open-sans-latin-ext-400-normal-81bc88c3.woff"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + bucket                 = "coverage-frontpage-prod"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "font/woff"
      + etag                   = "4f6ddc3f852a0a44c482d0ca76509173"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/open-sans-latin-ext-400-normal-81bc88c3.woff"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/assets/open-sans-latin-ext-400-normal-81bc88c3.woff"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/open-sans-latin-ext-400-normal-9c4d34f4.woff"] will be destroyed
  # (because key ["assets/open-sans-latin-ext-400-normal-9c4d34f4.woff"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - bucket                 = "coverage-frontpage-prod" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "font/woff" -> null
      - etag                   = "0a6f37e8da5950d7473d1ee801ae90c3" -> null
      - force_destroy          = false -> null
      - id                     = "assets/open-sans-latin-ext-400-normal-9c4d34f4.woff" -> null
      - key                    = "assets/open-sans-latin-ext-400-normal-9c4d34f4.woff" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../dist/assets/open-sans-latin-ext-400-normal-9c4d34f4.woff" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.static_files["assets/open-sans-vietnamese-400-normal-3c363040.woff"] will be destroyed
  # (because key ["assets/open-sans-vietnamese-400-normal-3c363040.woff"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - bucket                 = "coverage-frontpage-prod" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "font/woff" -> null
      - etag                   = "93af16e32b070735a242525cd9ba4834" -> null
      - force_destroy          = false -> null
      - id                     = "assets/open-sans-vietnamese-400-normal-3c363040.woff" -> null
      - key                    = "assets/open-sans-vietnamese-400-normal-3c363040.woff" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../dist/assets/open-sans-vietnamese-400-normal-3c363040.woff" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.static_files["assets/open-sans-vietnamese-400-normal-62829378.woff2"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + bucket                 = "coverage-frontpage-prod"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "font/woff2"
      + etag                   = "c01023539039aee9c88104f9dafcc26c"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/open-sans-vietnamese-400-normal-62829378.woff2"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/assets/open-sans-vietnamese-400-normal-62829378.woff2"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/open-sans-vietnamese-400-normal-984b3663.woff2"] will be destroyed
  # (because key ["assets/open-sans-vietnamese-400-normal-984b3663.woff2"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - bucket                 = "coverage-frontpage-prod" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "font/woff2" -> null
      - etag                   = "8993bf99b96f0cd7510903b05e03f7e8" -> null
      - force_destroy          = false -> null
      - id                     = "assets/open-sans-vietnamese-400-normal-984b3663.woff2" -> null
      - key                    = "assets/open-sans-vietnamese-400-normal-984b3663.woff2" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../dist/assets/open-sans-vietnamese-400-normal-984b3663.woff2" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.static_files["assets/open-sans-vietnamese-400-normal-e8b16384.woff"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + bucket                 = "coverage-frontpage-prod"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "font/woff"
      + etag                   = "1708dabfcb4b6d700835823893892ca8"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/open-sans-vietnamese-400-normal-e8b16384.woff"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/assets/open-sans-vietnamese-400-normal-e8b16384.woff"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
      ~ etag                   = "09470bf44f1759c044dd77631b39b512" -> "35ee7f66f4498f57bdc46637ba716a70"
        id                     = "index.html"
        tags                   = {}
      + version_id             = (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 16 to add, 1 to change, 16 to destroy.
```
</details>

:memo: Plan generated in [Frontpage #79](https://github.com/coverage-robot/frontpage/actions/runs/6613044086)